smartinou/map/projects/beastfeedher/firmware/builds/tm4c129exl/BSP.cpp
// *****************************************************************************
//
// Project: PFPP
//
// Module: BSP.
//
// *****************************************************************************

//! \file
//! \brief BSP class.
//! \ingroup application_bsp

// *****************************************************************************
//
//        Copyright (c) 2016-2022, Martin Garon, All rights reserved.
//
// *****************************************************************************

// *****************************************************************************
//                              INCLUDE FILES
// *****************************************************************************

#include <array>

// QP Library.
#include "qpcpp.h"

// CMSIS Library.
#include "TM4C129ENCPDT.h"

// TI Library.
//#define TARGET_IS_BLIZZARD_RA1
//#define DTARGET_IS_SNOWFLAKE_RA0
//#define PART_TM4C129ENCPDT
#include <inc/hw_ints.h>
//#include "inc/hw_memmap.h" // duplicated defines in TM4C129ENCPDT.h
#include <inc/hw_types.h>
#include <driverlib/flash.h>
#include <driverlib/fpu.h>
#include <driverlib/gpio.h>
#include <driverlib/interrupt.h>
#include <driverlib/pin_map.h>
#include <driverlib/rom.h>
#include <driverlib/rom_map.h>
#include <driverlib/sysctl.h>
#include <driverlib/systick.h>
#include <driverlib/uart.h>

#include <net/EthernetAddress.h>

// FatFS.
#include "ff.h"

#include "inc/Button.h"
#include "inc/GPIO.h"

#include "FatFSDisk.h"
#include "SDC.h"
#include "SPIMasterDev.h"
#include "DS3234.h"
#include "TB6612.h"

#include "Display_AOs.h"
#include "Logging_AOs.h"
//#include "BLE_AOs.h"
#include "LwIP_AOs.h"
#include "LwIP_Events.h"
#include "PFPP_AOs.h"
#include "RTCC_AOs.h"

#include "PFPP_Events.h"
#include "Signals.h"
#include "IBSP.h"
#include "BSP.h"

#include "netif/tm4c129/EthDrv.h"

#ifdef USE_UART0
#include "uartstdio.h"
#endif // USE_UART0

#ifdef USE_RTT
// SEGGER RTT.
#include <SEGGER_RTT.h>
#endif // USE_RTT

#ifdef Q_SPY
#if !defined(USE_UART0) && !defined(USE_RTT)
#error Must define USE_UART0 or USE_RTT for using Q_SPY
#endif
#endif // Q_SPY

// *****************************************************************************
//                      DEFINED CONSTANTS AND MACROS
// *****************************************************************************


// !!!!!!!!!!!!!!!!!!!!!!!!!!!!! CAUTION !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// Assign a priority to EVERY ISR explicitly by calling NVIC_SetPriority().
// DO NOT LEAVE THE ISR PRIORITIES AT THE DEFAULT VALUE!
// See NOTE00
enum KernelUnawareISRs {
    UART0_PRIO,
    // ...
    // Keep always last.
    MAX_KERNEL_UNAWARE_CMSIS_PRI
};


// "kernel-unaware" interrupts can't overlap "kernel-aware" interrupts.
Q_ASSERT_COMPILE(MAX_KERNEL_UNAWARE_CMSIS_PRI <= QF_AWARE_ISR_CMSIS_PRI);

// See NOTE00.
enum KernelAwareISRs {
    SYSTICK_PRIO = QF_AWARE_ISR_CMSIS_PRI,
    GPIOPORTA_PRIO,
    GPIOPORTE_PRIO,
    //GPIOPORTF_PRIO,
    // ...
    // Keep always last.
    MAX_KERNEL_AWARE_CMSIS_PRI
};

// "kernel-aware" interrupts should not overlap the PendSV priority.
Q_ASSERT_COMPILE(MAX_KERNEL_AWARE_CMSIS_PRI <= (0xFF >>(8-__NVIC_PRIO_BITS)));

static constexpr uint32_t sClkRate = 120000000;
static constexpr unsigned long sUartPortNbr = 0;
static constexpr uint32_t sUartBaudRate = 115200U;

enum RTTTerminal {
    _stdin = 0,
    _stdout = 1,
    _stderr = 2,
    _qspy = 3,
};
static constexpr unsigned int sRTTBufferIndex = 0U;
static constexpr size_t sRTTUpBufferSize = 1024;
static constexpr unsigned int sRTTQSPYTerminal = RTTTerminal::_qspy;

#ifdef Q_SPY

#define UART_TXFIFO_DEPTH   16U

#endif // Q_SPY

// *****************************************************************************
//                         TYPEDEFS AND STRUCTURES
// *****************************************************************************

namespace BSP {


class SSI2PinCfg
    : public CoreLink::SSIPinCfg {

public:
    constexpr SSI2PinCfg() noexcept
        : CoreLink::SSIPinCfg(2) {}

    void SetPins(void) const override {
        GPIO::EnableSysCtlPeripheral(sSSIPins.mPort);
        MAP_GPIOPinConfigure(GPIO_PD3_SSI2CLK);
        MAP_GPIOPinConfigure(GPIO_PD1_SSI2XDAT0);
        MAP_GPIOPinConfigure(GPIO_PD0_SSI2XDAT1);
        MAP_GPIOPinTypeSSI(
            sSSIPins.mPort,
            sSSIPins.mClkPin | sSSIPins.mRxPin | sSSIPins.mTxPin
        );

        // Set a weak pull-up on MISO pin for SD Card's proper operation.
        MAP_GPIOPadConfigSet(
            sSSIPins.mPort,
            sSSIPins.mRxPin,
            GPIO_STRENGTH_2MA,
            GPIO_PIN_TYPE_STD_WPU
        );

        MAP_GPIOPadConfigSet(
            sSSIPins.mPort,
            sSSIPins.mClkPin | sSSIPins.mTxPin,
            GPIO_STRENGTH_2MA,
            GPIO_PIN_TYPE_STD
        );
    }

private:
    // PD3: SSI0CLK
    // PD0: SSI0RX
    // PD1: SSI0TX
    static struct SSI2GPIO {
        unsigned long const mPort;
        unsigned int  const mClkPin;
        unsigned int  const mRxPin;
        unsigned int  const mTxPin;
    } constexpr sSSIPins = {
        GPIOD_AHB_BASE,
        GPIO_PIN_3, // Clk.
        GPIO_PIN_0, // Rx.
        GPIO_PIN_1  // Tx.
    };
};


class SSI3PinCfg
    : public CoreLink::SSIPinCfg {

public:
    constexpr SSI3PinCfg() noexcept
        : CoreLink::SSIPinCfg(3) {}

    void SetPins(void) const override {
        GPIO::EnableSysCtlPeripheral(sSSIPins.mPort);
        MAP_GPIOPinConfigure(GPIO_PQ0_SSI3CLK);
        MAP_GPIOPinConfigure(GPIO_PQ2_SSI3XDAT0);
        MAP_GPIOPinConfigure(GPIO_PQ3_SSI3XDAT1);
        MAP_GPIOPinTypeSSI(
            sSSIPins.mPort,
            sSSIPins.mClkPin | sSSIPins.mRxPin | sSSIPins.mTxPin
        );

        // Set a weak pull-up on MISO pin for SD Card's proper operation.
        MAP_GPIOPadConfigSet(
            sSSIPins.mPort,
            sSSIPins.mRxPin,
            GPIO_STRENGTH_2MA,
            GPIO_PIN_TYPE_STD_WPU
        );

        MAP_GPIOPadConfigSet(
            sSSIPins.mPort,
            sSSIPins.mClkPin | sSSIPins.mTxPin,
            GPIO_STRENGTH_2MA,
            GPIO_PIN_TYPE_STD
        );
    }

