smartinou/map/projects/beastfeedher/firmware/builds/tm4c129exl/BSP.cpp
private:
    // PQ0: SSI3CLK
    // PQ3: SSI3RX
    // PQ2: SSI3TX
    static struct SSI3GPIO {
        unsigned long mPort;
        unsigned int  mClkPin;
        unsigned int  mRxPin;
        unsigned int  mTxPin;
    } constexpr sSSIPins = {
        GPIOQ_BASE,
        GPIO_PIN_0, // Clk.
        GPIO_PIN_3, // Rx.
        GPIO_PIN_2  // Tx.
    };
};


class Factory final
    : public IBSPFactory {

public:
    ~Factory() = default;

    static std::shared_ptr<BSP::Factory> Instance(void) {
        if (nullptr == Factory::mInstance) {
            // Assigning the instance this way rather than with std::make_shared<>()
            // allows to make the Ctor private.
            BSP::Factory::mInstance = std::shared_ptr<BSP::Factory>(new Factory);
        }

        return Factory::mInstance;
    }


    // IBSPFactory Interface.
    std::shared_ptr<RTCC::AO::RTCC_AO> StartRTCCAO(
        std::shared_ptr<CalendarRec> const &aCalendarRec,
        uint8_t const aPrio,
        QP::QEvt const * aQSto[],
        uint32_t const aQLen
    ) final {
        if (mRTCCAO == nullptr) {
            mRTCC = CreateRTCC();
            // RTCC also implements both ITemperature and INVMem interfaces.
            mRTCCAO = std::make_shared<RTCC::AO::RTCC_AO>(mRTCC, mRTCC, mRTCC, aCalendarRec);
            if (mRTCCAO != nullptr) {
                mRTCCAO->start(aPrio, aQSto, aQLen, nullptr, 0U);
            }
        }
        return mRTCCAO;
    }

    // This could be used to get a temporary opaque pointer to RTCC AO,
    // For direct posting to AO for instance:
    //     QP::QActive * lPtr = GetOpaqueRTCCAO();
    //     lPtr->Post(myEvent);
    std::shared_ptr<QP::QActive> GetOpaqueRTCCAO(void) const { return mRTCCAO; }


    std::shared_ptr<QP::QActive> GetOpaqueBLEAO(void) const { return nullptr; }
    //QP::QActive *GetOpaqueBLEAO(void) override { return mBLEAO.get(); }


    unsigned int CreateDisks(void) {
        // This BSP has one or two SDC devices.
        if (mSDCDefault == nullptr) {
            // Drive index 0 is the default drive.
            static constexpr auto sDriveIndex = 0;
            static constexpr GPIO sCSnPin(GPIOD_AHB_BASE, GPIO_PIN_4);
            static constexpr GPIO sDetectPin(GPIOF_AHB_BASE, GPIO_PIN_7);
            mSDCDefault = std::make_shared<SDC>(sDriveIndex, mSPI3Dev, sCSnPin, sDetectPin);
        }

        if (mSDCBoosterPack == nullptr) {
            // Sharp 128x128 memory LCD & microSD card BoosterPack.
            // Card detect line requires 0Ohm resistor.
            static constexpr auto sDriveIndex = 1;
            static constexpr GPIO sCSnPin(GPIOC_AHB_BASE, GPIO_PIN_7);
            static constexpr GPIO sDetectPin(GPIOP_BASE, GPIO_PIN_2);
            mSDCBoosterPack = std::make_shared<SDC>(sDriveIndex, mSPI2Dev, sCSnPin, sDetectPin);
        }

        return FatFSDisk::GetDiskQty();
    }


    [[maybe_unused]] bool MountFS(void) final {
        // Create SDC instance to use in FS stubs.
        // WARNING: if SD card disks exist, they should be mounted before calling
        // any other device triggering SPI bus activity.
        // This can be handled in different order when SDCard socket is
        // powered via PIO, but it's not guaranteed the case on all targets.
        // See http://elm-chan.org/docs/mmc/mmc_e.html
        // Section: Consideration on Multi-slave Configuration
        unsigned int const lDiskQty = CreateDisks();
        if (0 != lDiskQty) {
            // Disks found: mount the default drive.
            static constexpr auto sDefaultDiskIndex = 0;
            FRESULT const lResult = FatFSDisk::StaticMountDisk(sDefaultDiskIndex, &sFatFS);
            if (FR_OK == lResult) {
                return true;
            }
        }

        // No disk found, or failed to mount default disk.
        return false;
    }


    [[maybe_unused]] bool StartFileSinkAO(
        uint8_t const aPrio,
        QP::QEvt const * aQSto[],
        uint32_t const aQLen
    ) final {
        // FS mounted on default disk: add log sink.
        if (mFileLogSinkAO == nullptr) {
            mFileLogSinkAO = std::make_shared<Logging::AO::FileSink_AO>(10 * 60 * BSP::TICKS_PER_SEC);
            if (mFileLogSinkAO != nullptr) {
                reinterpret_cast<Logging::AO::FileSink_AO * const>(
                    mFileLogSinkAO.get())->SetSyncLogLevel(LogLevel::prio::INFO);

                std::unordered_set<std::string> const lCategories = {"PFPP"};
                Logging::Event::Init const lFileLogInitEvent(DUMMY_SIG, lCategories);
                mFileLogSinkAO->start(
                    aPrio,
                    aQSto,
                    aQLen,
                    nullptr,
                    0U,
                    &lFileLogInitEvent
                );
                return true;
            }
        }
        return false;
    }


    [[maybe_unused]] bool StartPFPPAO(
        std::shared_ptr<FeedCfgRec> const &aFeedCfgRec,
        uint8_t const aPrio,
        QP::QEvt const * aQSto[],
        uint32_t const aQLen
    ) final {
        if (mPFPPAO == nullptr) {
            // Create motor controller and pass ownership to Mgr_AO.
            auto lMotorControl = CreateMotorControl();
            mPFPPAO = std::make_shared<PFPP::AO::Mgr_AO>(
                std::move(lMotorControl),
                aFeedCfgRec
            );
            if (mPFPPAO != nullptr) {
                mPFPPAO->start(aPrio, aQSto, aQLen, nullptr, 0U);
                return true;
            }
        }
        return false;
    }


    [[maybe_unused]] bool StartDisplayMgrAO(
        uint8_t const aPrio,
        QP::QEvt const * aQSto[],
        uint32_t const aQLen
    ) final {
        if (mDisplayMgrAO == nullptr) {
            // TODO: CREATE AN ACTUAL OBJECT WHEN AVAILABLE.
            mDisplayMgrAO = std::shared_ptr<Display::AO::Mgr_AO>(nullptr);
            if (mDisplayMgrAO != nullptr) {
                mDisplayMgrAO->start(aPrio, aQSto, aQLen, nullptr, 0U);
                return true;
            }
        }
        return false;
    }


