smartinou/map/projects/beastfeedher/firmware/builds/tm4c129exl/BSP.cpp
    [[maybe_unused]] bool StartLwIPMgrAO(
        uint8_t const aPrio,
        QP::QEvt const * aQSto[],
        uint32_t const aQLen,
        QP::QEvt const * const aInitEvt
    ) final {
        if (mLwIPMgrAO == nullptr) {
            // Create all Ethernet drivers required before the AO.
            // LwIP::AO::Mgr doesn't use any local references to LwIPDrv.
            // They are referenced via LwIPDrv static functions.
            CreateEthDrv();
            mLwIPMgrAO = std::make_shared<LwIP::AO::Mgr_AO>();
            if (mLwIPMgrAO != nullptr) {
                mLwIPMgrAO->start(aPrio, aQSto, aQLen, nullptr, 0U, aInitEvt);
                return true;
            }
        }
        return false;
    }


    std::shared_ptr<QP::QActive> CreateBLEAO(void) override {
        return nullptr;//std::make_shared<QP::QActive>(nullptr);//std::shared_ptr<PFPP::AO::BLE_AO>(nullptr);
    }


    // Local interface.
    static constexpr GPIO GetRTCCInterruptPin(void) { return mRTCCInterruptPin; }
    //static GPIO const &GetBLEInterruptPin(void) { return mBLEInterruptPin; }

    static uint8_t const sSysTick_Handler;
    static uint8_t const sGPIOPortP3_IRQHandler;

private:
    Factory(const Factory&) = delete;
    Factory& operator=(const Factory&) = delete;
    explicit Factory(uint32_t aClkRate = sClkRate)
        : mClkRate(aClkRate)
        , mSPI2Dev(nullptr)
        , mSPI3Dev(nullptr)
        , mRTCC(nullptr)
        , mRTCCAO(nullptr)
        , mFileLogSinkAO(nullptr)
        , mPFPPAO(nullptr)
        , mDisplayMgrAO(nullptr)
        , mSDCDefault(nullptr)
        , mSDCBoosterPack(nullptr)
    {
        // Ctor.
        Init();

        // SPIMasterDev is required with several devices.
        CreateSPIDev(2);
        CreateSPIDev(3);
        // TODO: CONSIDER CREATING RTCC HERE TOO.
    }


    void Init(void) {
        // NOTE: SystemInit() already called from the startup code,
        // where clock already set (CLOCK_SETUP in lm3s_config.h)
        // SystemCoreClockUpdate() also called from there.
        // Settings done for 50MHz system clock.

        mClkRate = SysCtlClockFreqSet(
            SYSCTL_XTAL_25MHZ
                | SYSCTL_OSC_MAIN
                | SYSCTL_USE_PLL
                | SYSCTL_CFG_VCO_480,
            mClkRate
        );

        // Floating point unit.
        MAP_FPUEnable();
        MAP_FPULazyStackingEnable();

        // Enable the clock to the peripherals used by the application.

        // Enable all required GPIO.
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
        //MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
        //MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);
        //MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOH);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOJ);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOP);

#ifdef USE_UART0
        // Debug UART port.
        static constexpr GPIO lU0RxGPIO(GPIOA_AHB_BASE, GPIO_PIN_0);
        static constexpr GPIO lU0TxGPIO(GPIOA_AHB_BASE, GPIO_PIN_1);
        MAP_GPIOPinConfigure(GPIO_PA0_U0RX);
        MAP_GPIOPinConfigure(GPIO_PA1_U0TX);
        MAP_GPIOPinTypeUART(
            lU0RxGPIO.GetPort(),
            lU0RxGPIO.GetPin() | lU0TxGPIO.GetPin()
        );
        // Enable UART0:
        // @115200, 8-N-1.
        // Flush the buffers.
        UARTStdioInit(sUartPortNbr, mClkRate, sUartBaudRate);
#endif // USE_UART0

#ifdef USE_RTT
    // Leave here until RTT has other use than QSPY.
    SEGGER_RTT_Init();
    static constexpr auto sRTTUpBufferName = "RTTUpBuffer";
    static uint8_t sRTTUpBuffer[sRTTUpBufferSize] = {0};
    int lResult = SEGGER_RTT_ConfigUpBuffer(
        sRTTBufferIndex,
        sRTTUpBufferName,
        &sRTTUpBuffer[0],
        sizeof(sRTTUpBufferSize),
        SEGGER_RTT_MODE_NO_BLOCK_SKIP
    );

    if (lResult < 0) {
        // Error while configuring buffer.
        return;
    }

    static constexpr auto sRTTDownBufferName = "RTTDownBuffer";
    static constexpr size_t sRTTDownBufferSize = 64;
    static uint8_t sRTTDownBuffer[sRTTDownBufferSize] = {0};
    lResult = SEGGER_RTT_ConfigDownBuffer(
        sRTTBufferIndex,
        sRTTDownBufferName,
        &sRTTDownBuffer[0],
        sizeof(sRTTDownBufferSize),
        SEGGER_RTT_MODE_NO_BLOCK_SKIP
    );

    if (lResult < 0) {
        // Error while configuring buffer.
        return;
    }

    //ITM_SendChar("Hello, World!\n");
    // TODO: HAS TO BE ENABLED FIRST.
    //ITM_SendChar('M');
#endif // USE_RTT

#ifdef Q_SPY
#ifdef USE_UART0
        // Enable interrupts.
        // Interrupt on rx FIFO half-full.
        // UART interrupts: rx and rx-to.
        MAP_UARTIntDisable(UART0_BASE, 0xFFFFFFFF);
        MAP_UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
        MAP_IntEnable(INT_UART0);
#endif // USE_UART0

        // Initialize the QS software tracing.
        if (0U == QS_INIT(nullptr)) {
            Q_ERROR();
        }
        QS_OBJ_DICTIONARY(&BSP::Factory::sSysTick_Handler);
        QS_OBJ_DICTIONARY(&sGPIOPortP3_IRQHandler);
        //QS_OBJ_DICTIONARY(&sGPIOPortC_IRQHandler);
        //QS_OBJ_DICTIONARY(&sGPIOPortD_IRQHandler);
        //QS_OBJ_DICTIONARY(&sGPIOPortF_IRQHandler);

        QS_OBJ_DICTIONARY(mPFPPAO.get());
        QS_OBJ_DICTIONARY(mLwIPMgrAO.get());
#endif // Q_SPY
    }


    void CreateSPIDev(unsigned int aSSIID) {
        switch (aSSIID) {
        case 2: {
            // Create pin configuration.
            // Initialize SPI Master.
            SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI2);
            static constexpr SSI2PinCfg lSSIPinCfg;
            mSPI2Dev = std::make_shared<CoreLink::SPIMasterDev>(
                SSI2_BASE,
                mClkRate,
                lSSIPinCfg
            );
        } break;
        case 3: {
            // Create pin configuration.
            // Initialize SPI Master.
            SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI3);
            static constexpr SSI3PinCfg lSSIPinCfg;
            mSPI3Dev = std::make_shared<CoreLink::SPIMasterDev>(
                SSI3_BASE,
                mClkRate,
                lSSIPinCfg
            );
        } break;
        case 0:
        case 1:
        default:
            return;
        }
    }


    std::shared_ptr<DS3234> CreateRTCC(void) {
        // Creates a DS3234 RTCC.
        // Reset input pin.
        static constexpr GPIO sResetPin(GPIOK_BASE, GPIO_PIN_7);
        // Calls the Ctor that uses default SPI slave configuration,
        // with specified CSn pin.
        static constexpr unsigned long sInterruptNumber = INT_GPIOP3;
        static GPIO sCSnPin(GPIOQ_BASE, GPIO_PIN_1);
        auto lRTCC = std::make_shared<DS3234>(
            2000,
            sInterruptNumber,
            mRTCCInterruptPin,
            mSPI3Dev,
            sCSnPin
        );

        return lRTCC;
    }


    std::unique_ptr<IMotorControl> CreateMotorControl(void) {
        static constexpr GPIO lIn1(GPIOB_AHB_BASE, GPIO_PIN_6);
        static constexpr GPIO lIn2(GPIOB_AHB_BASE, GPIO_PIN_5);
        static constexpr GPIO lPWM(GPIOB_AHB_BASE, GPIO_PIN_0);

        // In fact, creates *half* a TB6612.
        return std::make_unique<TB6612>(lIn1, lIn2, lPWM);
    }


    // When LwIP::AO::Mgr can get rid of any local reference to LwIPDrv,
    // it won't be necessary for this function to return a pointer to EthDrv.
    // It will be referenced via LwIPDrv static functions.
    void CreateEthDrv(void) {
        EthernetAddress const lMAC = GetMACAddress();
        static constexpr unsigned int sMyNetIFIndex = 0;
        static constexpr unsigned int sPBufQueueSize = 8;
        mEthDrv = std::make_unique<EthDrv>(
            sMyNetIFIndex,
            lMAC,
            sPBufQueueSize,
            mClkRate
        );
    }


